Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: The formTruncatingRemainder(dividingBy:) method is always exact.
ja: formTruncatingRemainder(dividingBy:)メソッドは常に正確です。

source: The remainder(dividingBy:) method is always exact.
ja: remainder(dividingBy:)メソッドは常に厳密に正確です。

source: The removeLast() method must be used only on a nonempty collection.
ja: removeLast()メソッドは、空でないコレクションでのみ使われるべきです。

source: The truncatingRemainder(dividingBy:) method is always exact.
ja: truncatingRemainder(dividingBy:)メソッドは常に正確です。

source: The ..< operator creates a range that doesn’t include the upper bound, so it’s always safe to use with endIndex.
ja: ..<演算子は上方の境界を含まないある範囲を作成します、それでそれは常にendIndexと使うのに安全です。

source: The == operator is a requirement of the Equatable protocol, which Comparable extends—see that protocol’s documentation for more information about equality in Swift.
ja: ==演算子は、Comparableが拡張するEquatableプロトコルの要件です — そのプロトコルの文書をSwiftにおける同等性についてのさらなる情報のために見てください。

source: The Key type of the dictionary is Int, and the Value type of the dictionary is String.
ja: 辞書のKey型はIntです、そして辞書のValue型はStringです。

source: The NSError parameter on an asynchronous throwing method must also be nullable, which indicates that the parameter is used only to communicate an error.
ja: 非同期スローメソッド上のNSErrorパラメータは、同様にnull可能でなければなりません、それはそのパラメータがエラーとの通信にのみ使われることを指し示します。

source: The String(describing:) initializer is the preferred way to convert an instance of any type to a string.
ja: String(describing:)イニシャライザは、あらゆる型のインスタンスをある文字列へ変換する好ましい方法です。

source: The high and low properties of the result value represent 2000 when concatenated to form a double-width integer; that is, using result.high as the high byte and result.low as the low byte of a UInt16 instance.
ja: result値のhighおよびlowプロパティは、二倍幅整数に成形するために連結される時2000を表します；すなわち、UInt16インスタンスの高バイトとしてresult.highをそして低バイトとしてresult.lowを使って。

source: The allSatisfy(_:) method checks to see whether all elements produced by the sequence are less than 10.
ja: allSatisfy(_:)メソッドは、シーケンスによって生み出されたすべての要素が10より小さいかどうか見るために調べます。

source: The contains(_:) method checks to see whether the sequence produces the value 5:
ja: contains(_:)メソッドは、シーケンスが値5を生み出すかどうか見るために調べます：

source: The contains(where:) method checks to see whether the sequence produces a value divisible by 3:
ja: contains(where:)メソッドは、シーケンスが3で割り切れる値を生み出すかどうか見るために調べます：

source: The drop(while:) method causes the modified sequence to ignore received values until it encounters one that is divisible by 3:
ja: drop(while:)メソッドは、修正されたシーケンスが、それが3によって割り切れるものに出くわすまで受け取った値を無視することを引き起こします：

source: The dropFirst(_:) method causes the modified sequence to ignore the values 0 through 4, and instead emit 5 through 10:
ja: dropFirst(_:)メソッドは、その修正されたシーケンスに値0から4を無視させます、そして代わりに5から10を放出させます：

source: The filter(_:) method returns true for even values and false for odd values, thereby filtering out the odd values, but also throws an error for values divisible by 5:
ja: filter(_:)メソッドは、trueを偶数値に対してそしてfalseを奇数値に対して返します、それによって奇数値を取り除いています、しかしまた５で割り切れる値に対してエラーをスローします：

source: The filter(_:) method returns true for even values and false for odd values, thereby filtering out the odd values:
ja: filter(_:)メソッドは、trueを偶数値に対してそしてfalseを奇数値に対して返します、それによって奇数値を取り除いています：

source: The first(where:) method returns the first member of the sequence that’s evenly divisible by both 2 and 3.
ja: first(where:)メソッドは、2と3の両方で整然と割り切れるこのシーケンスの最初のメンバーを返します。

source: The high and low compnents of the result value represent -1920 when concatenated to form a double-width integer; that is, using result.high as the high byte and result.low as the low byte of an Int16 instance.
ja: result値のhighとlow構成要素は、２倍幅整数に成形するために連結される場合-1920を表します；すなわち、result.highを高バイトとしてresult.lowを低バイトとしてInt16インスタンスに使って。

source: The max() method returns the max value of the sequence.
ja: max()メソッドは、シーケンスの最大値を返します。

source: The min() method returns the minimum value of the sequence.
ja: min()メソッドは、シーケンスの最小値を返します。

source: The prefix(_:) method causes the modified sequence to pass through the first six values, then end.
ja: prefix(_:)メソッドは、その修正されたシーケンスに最初の６つの値をずっと渡させて、それから終わらせます。

source: The prefix(_:) method causes the modified sequence to pass through values less than 8, but throws an error when it receives a value that’s divisible by 5:
ja: prefix(_:)メソッドは、修正されたシーケンスが8より少ない値それらを通過させる、しかしそれが5で割り切れる値を受け取る時はエラーをスローするようにします：

source: The prefix(while:) method causes the modified sequence to pass along values so long as they aren’t divisible by 2 and 3.
ja: prefix(while:)メソッドは、修正されたシーケンスが値それらを、それらが2と3によって割り切れない限り通過させるようにします。

source: The reduce(_:_:) method sums the values received from the asynchronous sequence.
ja: reduce(_:_:)メソッドは、非同期シーケンスから受け取った値それらを合計します。

source: The exponent of a floating-point value is the integer part of the logarithm of the value’s magnitude.
ja: 浮動小数点値の指数は、値の規模の対数の整数部分です。

source: The static type of a value is the known, compile-time type of the value.
ja: ある値の静的型は、既知の、コンパイル時のその値の型です。

source: The dynamic type of a value is the value’s actual type at run-time, which can be a subtype of its concrete type.
ja: ある値の動的型は、その値の実行時での実際の型です、それはそれの具象型の下位型であることができます。

source: The exponent bias of a type F can be calculated as the following, where ** is exponentiation:
ja: ある型Fの指数バイアスは、以下のように計算されます、ここで**は冪です：

source: The ASCII encoding value of this character, if it is an ASCII character.
ja: この文字のASCIIエンコーディング値、もしそれがASCIIならば。

source: The ASCII representation of a number in the radix passed as radix.
ja: radixとして渡される基数におけるある数のASCII表現。

source: The ASCII representation of a number.
ja: ある数のASCII表現。

source: The Boolean value to copy.
ja: コピーされるブール値。

source: The Boolean value to negate.
ja: 否定するブール値。

source: The Boolean wrapped in a data value.
ja: あるデータ値の中のラップされるブール。

source: The C bool and Boolean types and the Objective-C BOOL type are all bridged into Swift as Bool.
ja: CのboolおよびBoolean型とObjective-CのBOOL型は、すべてSwiftにBoolとしてブリッジされます。

source: The C ‘_Bool’ and C++ ‘bool’ type.
ja: Cの「_Bool」およびC++の「bool」型。

source: The C ‘_Float16’ type.
ja: C「_Float16」型。

source: The C ‘char’ type.
ja: Cの「char」型。

source: The C ‘double’ type.
ja: C「double」型。

source: The C ‘float’ type.
ja: C「float」型。

source: The C ‘int’ type.
ja: C「int」型。

source: The C ‘long long’ type.
ja: C「long long」型。

source: The C ‘long’ type.
ja: C「long」型。

source: The C ‘short’ type.
ja: C「short」型。

source: The C ‘signed char’ type.
ja: C「signed char」型。

source: The C ‘unsigned char’ type.
ja: C「unsigned char」型。

source: The C ‘unsigned int’ type.
ja: C「unsigned int」型。

source: The C ‘unsigned long long’ type.
ja: C「unsigned long long」型。

source: The C ‘unsigned long’ type.
ja: C「unsigned long」型。

source: The C ‘unsigned short’ type.
ja: C「unsigned short」型。

source: The C++ ‘wchar_t’ type.
ja: C++「wchar_t」型。

source: The C++11 ‘char16_t’ type, which has UTF-16 encoding.
ja: C++11「char16_t」型、それはUTF-16エンコーディングされます。

source: The C++11 ‘char32_t’ type, which has UTF-32 encoding.
ja: C++11「char32_t」型、それはUTF-32エンコーディングされます。

source: The Cocoa delegation pattern doesn't require that delegates are instantiated.
ja: Cocoa委任パターンは、委任先がインスタンス化されることを要求しません。

source: The IEEE 754 floating-point classes.
ja: IEEE 754浮動小数点の様々な部類。

source: The NaN values in the tempsCelsius array are propagated through the conversion and remain NaN in tempsFahrenheit.
ja: tempsCelsius配列の中のNaN値は、変換を通して伝播されていき、tempsFahrenheitにおいてNaNのままです。

source: The Objective-C declarations are automatically available from any Swift file within that target, with no import statements.
ja: Objective-C宣言は、自動的にあらゆるSwiftファイルからそのターゲット内部で、インポート文なしで利用可能です。

source: The Sendable protocol indicates that value of the given type can be safely used in concurrent code.
ja: Sendableプロトコルは、与えられた型の値が並行性コードにおいて安全に使用できることを指し示します。

source: The Swift interfaces in the generated header include references to all of the Objective-C types used in them, so make sure to import the Objective-C headers for those types first.
ja: 生成されたヘッダの中のSwiftインタフェースそれらは、それらの中で使われるObjective-C型への全ての参照を含みます、それで最初にそれらの型に対するObjective-Cヘッダをインポートすることを確実にしてください。

source: The Swift standard library and Foundation use structures for types you use frequently, such as numbers, strings, arrays, and dictionaries.
ja: Swift標準ライブラリとFoundationは、あなたが頻繁に使う型、例えば数、文字列、配列、そして辞書などに対して構造体を使います。

source: The Unicode encoding of input.
ja: inputのユニコードエンコーディング。

source: The Unicode scalar value to convert into a character.
ja: １つの文字へ変換するユニコードスカラー値。

source: The UnsafeSendable protocol indicates that value of the given type can be safely used in concurrent code, but disables some safety checking at the conformance site.
ja: UnsafeSendableプロトコルは、与えられた型の値が並行性コードにおいて安全に使用できる、しかしいくつかの安全検査を適応場所で作動しなくすることを指し示します

source: The absolute value of x must be representable in the same type.
ja: xの絶対値は、同じ型において表現可能である必要があります。

source: The absolute value of x.
ja: xの絶対値。

source: The accessed slice uses the same indices for the same elements as the original collection uses.
ja: アクセスされるスライス（切り取り）は、同じ要素に対して元のコレクションが使うのと同じインデックスを使います。

source: The accessed slice uses the same indices for the same elements as the original collection.
ja: アクセスされるスライス（切り取り）は、同じ要素に対して元のコレクションと同じインデックスを使います。

source: The addition operator (+) calculates the sum of its two arguments.
ja: 加算演算子（+）は、それの２つの引数の合計を計算します。

source: The additive inverse of the argument.
ja: この引数の加法の逆元。

source: The address passed as bitPattern must have the correct alignment for the pointer’s Pointee type.
ja: bitPatternとして渡されるアドレスは、ポインタの持つPointee型に対して整合状態でなければなりません。

source: The algorithm used to create random values may change in a future version of Swift.
ja: 無作為値を作成するために使われるアルゴリズムは、将来のSwiftバージョンで変わるかもしれません。

source: The algorithm used to select a random element may change in a future version of Swift.
ja: ある無作為な要素を選択するために使われるアルゴリズムは、将来のSwiftバージョンで変わるかもしれません。

source: The algorithm used to shuffle a collection may change in a future version of Swift.
ja: あるコレクションをシャッフルするために使われるアルゴリズムは、将来のSwiftバージョンで変わるかもしれません。

source: The algorithm used to shuffle a sequence may change in a future version of Swift.
ja: あるシーケンスをシャッフルするために使われるアルゴリズムは、将来のSwiftバージョンで変更するかもしれません。

source: The allowed formats for each of these representations is then as follows:
ja: これらの表現のそれぞれに対する許される形式はそれで以下になります：

source: The alpha-2 code for The United States is “US”, so its flag character is made up of the Unicode scalar values "\u{1F1FA}" (REGIONAL INDICATOR SYMBOL LETTER U) and "\u{1F1F8}" (REGIONAL INDICATOR SYMBOL LETTER S).
ja: アメリカ合衆国に対するalpha-2コードは、「US」です、それでそれの国旗文字はユニコードスカラー値"\u{1F1FA}"（REGIONAL INDICATOR SYMBOL LETTER U）と"\u{1F1F8}"（REGIONAL INDICATOR SYMBOL LETTER S）から作り上げられます。

source: The amount to step by with each iteration.
ja: 各反復でそれだけ間隔をとることになる量。

source: The argument is valid only for the duration of the closure’s execution.
ja: 引数は、ただクロージャの実行の間に対してのみ有効とされます。

source: The array to append to.
ja: 追加先の配列。

source: The array wrapped in a data value.
ja: データ値の中にラップされる配列。

source: The arrays in the “values” position of the new dictionary each contain at least one element, with the elements in the same order as the source sequence.
ja: 新しい辞書の「values」位置での配列は、それぞれ少なくとも１つの要素を含み、元となるシーケンスと同じ順序で要素を持ちます。

source: The array’s Element type must be a trivial type, which can be copied with just a bit-for-bit copy without any indirection or reference-counting operations.
ja: この配列の持つElement型は自明型でなければなりません、それは単にビット対ビットコピーでコピーされることが、何らかの間接参照または参照カウント操作なしで可能です。

source: The array’s “past the end” position—that is, the position one greater than the last valid subscript argument.
ja: 配列の「終わりを過ぎた」位置—すなわち、最後の有効な添え字引数より１つ大きい位置。

source: The assignment to the oBreve constant calls this initializer behind the scenes.
ja: oBreve定数への代入は、このイニシャライザを舞台裏で呼びます。

source: The asynchronous iterator for iterating a AsyncStream.
ja: AsyncStreamを反復するための非同期イテレータ。

source: The asynchronous iterator for iterating a AsyncThrowingStream.
ja: AsyncThrowingStreamを反復するための非同期イテレータ。

source: The attribute container with the keys and values to populate this dictionary with.
ja: この辞書にそれらを入れることになるキーと値それらを備えた属性コンテナ。

source: The attribute scope of the keys in container that a key path identifies.
ja: あるキーパスが識別するcontainerの中のキーそれらの属性スコープ。

source: The attribute scope of the keys in container.
ja: containerの中のキーそれらの属性スコープ。

source: The available number of fractional significand bits.
ja: 利用可能な小数の仮数ビットの数。

source: The base state.
ja: 基底状態。

source: The base, precision, and exponent range are not fixed in any way by this protocol, but it enforces the basic requirements of any IEEE 754 floating-point type.
ja: 基数、精度、そして指数範囲は、このプロトコルによって何らかの方法で固定されません、しかしそれはIEEE 754浮動小数点型どれかの基本要件を強要します。

source: The big-endian representation of this integer.
ja: この整数のビッグエンディアン表現。

source: The bit pattern matches the binary interchange format defined by the IEEE 754 specification.
ja: ビットパターンはIEEE 754仕様で定義されるバイナリ交換形式に一致します。

source: The bit pattern of the value’s encoding.
ja: 値の持つエンコーディングのビットパターン。

source: The bit pattern to use for the exponent field of the new value.
ja: 新しい値の指数フィールドに使うためのビットパターン。

source: The bit pattern to use for the significand field of the new value.
ja: 新しい値の仮数フィールドに使うためのビットパターン。

source: The bit width of a Int16 instance is 16.
ja: Int16インスタンスのビット幅は16です。

source: The bit width of a Int32 instance is 32.
ja: Int32インスタンスのビット幅は32です。

source: The bit width of a Int instance is 32 on 32-bit platforms and 64 on 64-bit platforms.
ja: Intインスタンスのビット幅は、32ビットプラットホーム上では32そして64ビットプラットホーム上では64です。

source: The bitwise NOT operator (~) is a prefix operator that returns a value in which all the bits of its argument are flipped: Bits that are 1 in the argument are 0 in the result, and bits that are 0 in the argument are 1 in the result.
ja: ビット単位のNOT演算子（~）は前置演算子で、それの引数のビットすべてがひっくり返されるある値を返します：引数において1であるビットは結果において0になります、そして引数において0であるビットは結果において1になります。

source: The block has a void return type.
ja: そのブロックはvoid戻り型を持つ。

source: The block is called exactly once, on all possible paths of control flow.
ja: そのブロックは、制御の流れの全ての可能な経路上で、厳密に一回だけ呼び出される。

source: The bounds of the range must be valid indices of the array.
ja: 範囲の境界は、配列の有効なインデックスでなければなりません。

source: The bounds of the range must be valid indices of the collection.
ja: この範囲の境界は、コレクションの有効なインデックスでなければなりません。

source: The bounds of the result are always limited to the bounds of limits.
ja: 結果の領域は、常にlimitsの領域に制限されます。

source: The buffer is the size of the instance passed as value and does not include any remote storage.
ja: バッファは、valueとして渡されるインスタンスの大きさで、あらゆるリモートストレージを含みません。

source: The buffer pointer argument is valid only for the duration of the closure’s execution.
ja: バッファポインタは、ただクロージャの実行の間に対してのみ有効とされます。

source: The buffer pointer argument to the body closure provides a collection interface to the raw bytes of value.
ja: bodyクロージャへのバッファポインタ引数は、valueの生のバイトへのコレクションインターフェイスを提供します。

source: The buffering is only for values that have yet to be consumed by iteration.
ja: バッファするのは、まだ反復によって消費されない値に対してだけです。

source: The build closure passes in a Continuation which can be used in concurrent contexts.
ja: buildクロージャは、あるContinuationに渡されます、それは並行性文脈において使われることが可能です。

source: The call to reserveCapacity(_:) increases the values array’s capacity by exactly 10 elements on each pass through addTenQuadratic(), which is linear growth.
ja: reserveCapacity(_:)を呼び出すことは、values配列の容量を正確に10要素ずつaddTenQuadratic()が行われる各々で漸増します、それは線形成長です。

source: The callback is disposed of after any terminal state is reached.
ja: コールバックは、何であれ終端状態が到達される後に処理されます。

source: The classification of this value.
ja: この値の分類。

source: The closure is called again repeatedly with the previous call’s return value and each element of the sequence.
ja: クロージャは、前の呼び出しの戻り値とシーケンスの各要素とともに繰り返して再び呼び出されます。

source: The closure is called again repeatedly with the updated accumulating value and each element of the sequence.
ja: クロージャは、更新された蓄積値とシーケンスの各要素とともに繰り返して再び呼び出されます。

source: The closure provided to the compactMap(_:) method takes each Int and looks up a corresponding String from a romanNumeralDict dictionary.
ja: compactMap(_:)メソッドに提供されたクロージャは、各Intをとり、そして対応しているStringをromanNumeralDict辞書から捜します。

source: The closure provided to the map(_:) method takes each Int and looks up a corresponding String from a romanNumeralDict dictionary.
ja: map(_:)メソッドに提供されたクロージャは、各Intをとり、そして対応しているStringをromanNumeralDict辞書から捜します。

source: The closure returns the desired value for the final dictionary.
ja: このクロージャは、最終的な辞書に対して望む値を返します。

source: The code sample below declares a dictionary called interestingNumbers with string keys and values that are integer arrays, then sorts each array in-place in descending order.
ja: 下のコード見本は、interestingNumbersと呼ばれる辞書を文字列キーと整数配列である値で宣言します、それから各配列をその場で降順にソートします。

source: The coding path for the returned error is constructed by appending the given container’s current index to its coding path.
ja: 返されるエラーのためのコーディングパスは、与えられたコンテナの持つ現在のインデックスをそれのコーディングパスに加えることで組み立てられます。

source: The coding path for the returned error is constructed by appending the given key to the given container’s coding path.
ja: 返されるエラーのためのコーディングパスは、与えられたキーをその与えられたコンテナの持つコーディングパスに加えることで組み立てられます。

source: The coding path for the returned error is the given container’s coding path.
ja: 返されるエラーのためのコーディングパスは、与えられたコンテナの持つコーディングパスです。

source: The collection being appended to allocates any additional necessary storage to hold the new elements.
ja: コレクションは追加されることによって、新しい要素を保有するために何らかの追加的に必要なストレージを割り当てます。

source: The collection must not be empty.
ja: コレクションは空であってはなりません。

source: The collection of changes passed as changes must meet these requirements:
ja: changesとして渡される変更いくつかからなるこのコレクションは、３つの要件に合わなければなりません：

source: The collection to evaluate this range expression in relation to.
ja: このコレクションに関して、この範囲式を評価します。

source: The collection to wrap.
ja: ラップされるコレクション。

source: The collection’s “past the end” position.
ja: このコレクションの「終わりを過ぎた」位置。

source: The collection’s “past the end” position—that is, the position one greater than the last valid subscript argument.
ja: コレクションの「終わりを過ぎた」位置—すなわち、最後の有効な添え字引数より１つ大きい位置。

source: The compact map sequence produces whatever type of element its transforming closure produces.
ja: コンパクトマップシーケンスは、それの変換クロージャが生み出す要素の型が何であろうとも生み出します。

source: The compiler automatically synthesizes your custom type’s Hashable and requirements when you declare Hashable conformance in the type’s original declaration and your type meets these criteria:
ja: コンパイラは、自動的にあなたのあつらえの型のもつHashableと要件を、あなたがHashable準拠をその型の持つ元の宣言において宣言して、あなたの型がそれら基準に合う場合に合成します。

source: The compiler can automatically provide an implementation of the CaseIterable requirements for any enumeration without associated values or @available attributes on its cases.
ja: コンパイラは、自動的にCaseIterable要件の実装を提供することが、関連値または@available属性をそれのケース節上で持たないあらゆる列挙に対して可能です。

source: The compiler prevents bridging the moreColors array, on the other hand, because its Element type is Optional<String>, which does not bridge to a Foundation type.
ja: コンパイラは、moreColors配列をブリッジすることを妨げます、言い換えれば、それのElement型がOptional<String>であるので、それはFoundation型にブリッジしません。

source: The compiler removes Ref from the end of each type name because all Swift classes are reference types; therefore, the suffix is redundant.
ja: コンパイラは各型名の終わりからRefを削除します、なぜなら全てのスウィフトクラスが参照型であるからです；したがって、この接尾辞は冗長です。

source: The components used for hashing must be the same as the components compared in your type’s == operator implementation.
ja: ハッシュ化に使用される構成要素は、あなたの型のもつ==演算子実装において比較される構成要素と同じでなければなりません。

source: The condition to test.
ja: テストする条件。

source: The contents of the Objective-C files in that framework are automatically available from any Swift file within that framework target, with no import statements.
ja: そのフレームワークの中のObjective-Cファイルの内容は、自動的にそのフレームワークターゲット内のあらゆるSwiftファイルから、インポート文なしで利用可能です。

source: The contents of this sequence, as an asychronous sequence of Unicode scalar values.
ja: このシーケンスの内容、ユニコードスカラー値それらからなる非同期シーケンスとして。

source: The contents of this sequence, as an asychronous sequence of characters.
ja: このシーケンスの内容、文字それらからなる非同期シーケンスとして。

source: The contents of this sequence, as an asychronous sequence of lines of text.
ja: このシーケンスの内容、テキスト行それらからなるある非同期シーケンスとして。

source: The context in which the error occurred.
ja: そこにおいてエラーが起こった前後関係。

source: The conversion of p to a string in the assignment to s uses the Point type’s debugDescription property.
ja: pの文字列への変換はsへの代入において、Point型のもつdebugDescriptionプロパティを使います。

source: The conversion of p to a string in the assignment to s uses the Point type’s description property.
ja: sへの代入におけるpの文字列への変換は、Point型のもつdescriptionプロパティを使います。

source: The correct approach in Swift is to compare the i value with zero in the while statement.
ja: Swiftにおける正しい取り組みは、while文においてi値を0と比較することです。

source: The corresponding value of the raw type.
ja: この生の型の対応している値。

source: The current playground logging implementation logs specialized descriptions of at least the following types:
ja: 現在のプレイグラウンドログ実装は、少なくとも以下の型の特殊化された記述を記録します：

source: The custom mirror for this instance.
ja: このインスタンスのためのあつらえのミラー。

source: The decoder to read data from.
ja: それからデータを読み出すデコーダ。

source: The default IEEE 754 behavior of operations involving a signaling NaN is to raise the Invalid flag in the floating-point environment and return a quiet NaN.
ja: シグナルNaNを伴う演算の初期状態のIEEE 754挙動は、無効なフラグを浮動小数点環境において上げて、クワイエットNaNを返すことになります。

source: The default cancellation thrown when a task is cancelled.
ja: あるタスクが取り消される時にスローされる省略時の取り消し。

source: The default implementation of the != operator function satisfies this requirement.
ja: !=演算子関数の省略時の実装は、この要件を満たします。

source: The default implementation returns 0.
ja: 省略時の実装は、０を返します。

source: The default is 10.
ja: 省略時は10。

source: The default is 0.
ja: 省略時には0です。

source: The default is Int.max.
ja: 省略時にはInt.maxです。

source: The default is false.
ja: 初期状態はfalseです。

source: The default is true.
ja: 省略時ではtrueです。

source: The default is nil.
ja: 省略時にはnilです。

# The default is a newline (" ").
source: The default is a newline ("\n").
ja: 初期状態では改行（"\n"）です。

source: The default is a single space (" ").
ja: 初期状態では、単一の空白（" "）です。

source: The default is an empty string.
ja: 初期状態では空の文字列です。

source: The default is the file where assert(_:_:file:line:) is called.
ja: 初期状態では、assert(_:_:file:line:)が呼び出されるところのファイルです。

source: The default is the file where assertionFailure(_:file:line:) is called.
ja: 初期状態では、assertionFailure(_:file:line:)が呼び出されたところのファイルです。

source: The default is the file where fatalError(_:file:line:) is called.
ja: 初期状態では、fatalError(_:file:line:)が呼び出されたところのファイルです。

source: The default is the file where precondition(_:_:file:line:) is called.
ja: 初期状態では、precondition(_:_:file:line:)が呼び出されるところのファイルです。

source: The default is the file where preconditionFailure(_:file:line:) is called.
ja: 初期状態では、preconditionFailure(_:file:line:)が呼び出されたところのファイルです。

source: The default is the line number where assert(_:_:file:line:) is called.
ja: 初期状態では、assert(_:_:file:line:)が呼び出されるところの行番号です。

source: The default is the line number where assertionFailure(_:file:line:) is called.
ja: 初期状態では、assertionFailure(_:file:line:)が呼び出されたところの行番号です。

source: The default is the line number where fatalError(_:file:line:) is called.
ja: 初期状態では、fatalError(_:file:line:)が呼び出されたところの行番号です。

source: The default is the line number where precondition(_:_:file:line:) is called.
ja: 初期状態では、precondition(_:_:file:line:)が呼び出されるところの行番号です。

source: The default is the line number where preconditionFailure(_:file:line:) is called.
ja: 初期状態では、preconditionFailure(_:file:line:)が呼び出されたところの行番号です。

source: The default separator is an empty string.
ja: 省略時の分離子は空の文字列です。

source: The default type for an otherwise-unconstrained Boolean literal.
ja: ブールリテラルである他は別途制約されない省略時用の型。

source: The default type for an otherwise-unconstrained Unicode extended grapheme cluster literal.
ja: 別途制約されないユニコード拡張書記素クラスタリテラルのための省略時型。

source: The default type for an otherwise-unconstrained floating-point literal.
ja: 別途制約されない浮動小数点リテラルのための省略時型。
